Статистика работы механизмов/Конфигурация/DataProcessors/_КонтрольИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_КонтрольИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПлановыеОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДинамическийРасчетСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Претрейд</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтоПретрейд</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУчитывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БрокерРасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Депозит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рынок</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Купон</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Классификация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПогашенияДепозита</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВторойЧастиРЕПО</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаРЕПО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СделкаСЦентральнымКонтрагентом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дюрация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставГрупповогоКонтроля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвестиционнаяДекларация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРезультата</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроверки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговораДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_КонтрольИнвестиционныхДеклараций/Forms/СоставСовокупнойИнвестиционнойДекларации/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСоставаСовокупнойИнвестДекларации = Параметры.АдресСоставаСовокупнойИнвестДекларации;
	ЭтаФорма.РежимГруппировки = "ПоСчетам";
	ПереключитьРежимГруппировки(ЭтаФорма.РежимГруппировки);
	
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	ЗаполнитьТаблицуИзДерева();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОКНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСовокупнойИнвестДекларацииВключенПриИзменении(Элемент)
	
	УстановитьФлаги();
	ЗаполнитьСовокупныеПоказатели(ЭтаФорма);
	СоставСовокупнойИнвестДекларацииПриАктивизацииСтроки(Неопределено);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ЗаполнитьСовокупныеПоказатели(ЭтаФорма)

	Если ЭтаФорма.РежимГруппировки = "ПоСчетам" Тогда
		
		// т.к. счета ДУ на верхнем уровне - обходим только верхний уровень
		
		ЭтаФорма.СовокупнаяСЧА = 0;
		ЭтаФорма.СовокупнаяРСА = 0;
		
		Для каждого СтрокаРодитель Из ЭтаФорма.СоставСовокупнойИнвестДекларации.ПолучитьЭлементы() Цикл
		
			Если СтрокаРодитель.Включен Тогда
			
				ЭтаФорма.СовокупнаяСЧА = ЭтаФорма.СовокупнаяСЧА + СтрокаРодитель.СЧА;
				ЭтаФорма.СовокупнаяРСА = ЭтаФорма.СовокупнаяРСА + СтрокаРодитель.РСА;
			
			КонецЕсли; 
		
		КонецЦикла;
		
	ИначеЕсли ЭтаФорма.РежимГруппировки = "ПоИД" Тогда 
		
		Для каждого СтрокаРодитель Из ЭтаФорма.СоставСовокупнойИнвестДекларации.ПолучитьЭлементы() Цикл
			
			Если СтрокаРодитель.СовокупныйКонтроль Тогда
			
				СтрокаРодитель.СЧА = 0;	
				СтрокаРодитель.РСА = 0;
				СтрокаРодитель.Включен = Ложь;
				
				Для каждого СтрокаПодчиненный Из СтрокаРодитель.ПолучитьЭлементы() Цикл
				
					СтрокаРодитель.Включен = СтрокаРодитель.Включен Или СтрокаПодчиненный.Включен;
					Если СтрокаПодчиненный.Включен Тогда
						СтрокаРодитель.СЧА = СтрокаПодчиненный.СЧА + СтрокаРодитель.СЧА;
						СтрокаРодитель.РСА = СтрокаПодчиненный.РСА + СтрокаРодитель.РСА;
					КонецЕсли;
				
				КонецЦикла; 				
			
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги()

	// совокупные показатели в строках таблицы
	ТекДанные = ЭтаФорма.Элементы.СоставСовокупнойИнвестДекларации.ТекущиеДанные;
	
	Родитель = ТекДанные.ПолучитьРодителя();
		
	Если Родитель = Неопределено Тогда
		// устанавливаем флаги подчиненных
		Родитель = ТекДанные;
		Для каждого ПодчиненныйЭлемент Из Родитель.ПолучитьЭлементы() Цикл
			ПодчиненныйЭлемент.Включен = Родитель.Включен;
		КонецЦикла; 
	Иначе
		// меняем флаг родителя
		Родитель.Включен = Ложь;
		Для каждого ПодчиненныйЭлемент Из Родитель.ПолучитьЭлементы() Цикл
			Родитель.Включен = Родитель.Включен Или ПодчиненныйЭлемент.Включен;
		КонецЦикла; 
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура КомандаКопироватьСЧА(Команда)
	ПоместитьЗначениеВБуферОбмена(Формат(ЭтаФорма.СовокупнаяРСА, "ЧН=0,00; ЧГ=0"));
КонецПроцедуры

&НаКлиенте
Процедура КомандаКопироватьРСА(Команда)
	ПоместитьЗначениеВБуферОбмена(Формат(ЭтаФорма.СовокупнаяРСА, "ЧН=0,00; ЧГ=0"));
КонецПроцедуры
 
&НаКлиенте
Процедура ПоместитьЗначениеВБуферОбмена(Значение)

	COMОбъект = Новый COMОбъект("htmlfile");
    COMОбъект.ParentWindow.ClipboardData.Setdata("Text", Значение);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоИзТаблицы()

	Таблица = ПолучитьИзВременногоХранилища(АдресСоставаСовокупнойИнвестДекларации).Скопировать();
	Дерево = РеквизитФормыВЗначение("СоставСовокупнойИнвестДекларации");
	
	Дерево.Строки.Очистить();
	
	ТекущаяИД = Неопределено;
	ТекСчетДУ = Неопределено;
	
	Если ЭтаФорма.РежимГруппировки = "ПоИД" Тогда
		Таблица.Сортировать("ПорядокКонтроля, СовокупныйКонтроль УБЫВ, ИнвестиционнаяДекларацияПредставление, Организация, КодСчета");
	ИначеЕсли ЭтаФорма.РежимГруппировки = "ПоСчетам" Тогда	
		Таблица.Сортировать("Организация, СчетДоверительногоУправления, ПорядокКонтроля, СовокупныйКонтроль УБЫВ, ИнвестиционнаяДекларация");
	КонецЕсли; 
	
	Для каждого СтрокаТаблица Из Таблица Цикл
		
		Если ЭтаФорма.РежимГруппировки = "ПоИД" Тогда
			
			Если ТекущаяИД <> СтрокаТаблица.ИнвестиционнаяДекларация Или Не СтрокаТаблица.СовокупныйКонтроль Тогда
				
				ТекущаяИД = СтрокаТаблица.ИнвестиционнаяДекларация;
				СтрокаДереваРодитель = Дерево.Строки.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаДереваРодитель, СтрокаТаблица);
				
				Если СтрокаТаблица.СовокупныйКонтроль Тогда
					
					СтрокаДереваРодитель.Организация_ТипИД 	= СтрокаТаблица.ТипИнвестиционнойДекларации;
					СтрокаДереваРодитель.СчетДУ_ИД 			= СтрокаТаблица.ИнвестиционнаяДекларацияПредставление;
					
				Иначе
					
					СтрокаДереваРодитель.Организация_ТипИД 	= СтрокаТаблица.ОрганизацияПредставление;
					СтрокаДереваРодитель.СчетДУ_ИД 			= СтрокаТаблица.СчетДоверительногоУправленияПредставление + ", " + СтрокаТаблица.КодСчета;
					
				КонецЕсли; 

			КонецЕсли; 
			
			Если СтрокаТаблица.СовокупныйКонтроль Тогда
				// Добавим совокупные
				
				СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблица);
				СтрокаДерева.Организация_ТипИД 	= СтрокаТаблица.ОрганизацияПредставление;
				СтрокаДерева.СчетДУ_ИД 			= СтрокаТаблица.СчетДоверительногоУправленияПредставление + ", " + СтрокаТаблица.КодСчета;
				
			КонецЕсли;
		
		ИначеЕсли ЭтаФорма.РежимГруппировки = "ПоСчетам" Тогда 
			
			Если ТекСчетДУ <> СтрокаТаблица.СчетДоверительногоУправления Тогда
			
				ТекСчетДУ = СтрокаТаблица.СчетДоверительногоУправления;
				СтрокаДереваРодитель = Дерево.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДереваРодитель, СтрокаТаблица, , "Назначение");
				
				СтрокаДереваРодитель.Организация_ТипИД 	= СтрокаТаблица.ОрганизацияПредставление;
				СтрокаДереваРодитель.СчетДУ_ИД 			= СтрокаТаблица.СчетДоверительногоУправленияПредставление + ", " + СтрокаТаблица.КодСчета;
				
			КонецЕсли; 
			
			СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблица);
			СтрокаДерева.Организация_ТипИД = СтрокаТаблица.ТипИнвестиционнойДекларации;
			СтрокаДерева.СчетДУ_ИД = СтрокаТаблица.ИнвестиционнаяДекларацияПредставление;
			
		КонецЕсли;
	
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "СоставСовокупнойИнвестДекларации");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзДерева()

	Таблица = ПолучитьИзВременногоХранилища(АдресСоставаСовокупнойИнвестДекларации).СкопироватьКолонки();
	Дерево = РеквизитФормыВЗначение("СоставСовокупнойИнвестДекларации");
	
	Для каждого СтрокаДереваРодитель Из Дерево.Строки Цикл
	
		Если ЭтаФорма.РежимГруппировки = "ПоИД" Тогда
		
			Если СтрокаДереваРодитель.СовокупныйКонтроль Тогда
				
				Для каждого СтрокаДерева Из СтрокаДереваРодитель.Строки Цикл
				
					СтрокаТаблицы = Таблица.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДерева);
				
				КонецЦикла;			
				
			Иначе
				
				СтрокаТаблицы = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДереваРодитель);
				
			КонецЕсли; 
			
		ИначеЕсли ЭтаФорма.РежимГруппировки = "ПоСчетам" Тогда 
			
			Для каждого СтрокаДерева Из СтрокаДереваРодитель.Строки Цикл
				
				СтрокаТаблицы = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДерева);
							
			КонецЦикла;
			
		КонецЕсли;
				
	КонецЦикла; 
	
	ПоместитьВоВременноеХранилище(Таблица, АдресСоставаСовокупнойИнвестДекларации);

КонецПроцедуры

&НаКлиенте
Процедура КомандаГруппировкаПоСчетамДУ(Команда)
	ПереключитьРежимГруппировки("ПоСчетам", Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаГруппировкаПоДекларациям(Команда)
	ПереключитьРежимГруппировки("ПоИД", Истина);
КонецПроцедуры

&НаСервере
Процедура ПереключитьРежимГруппировки(Режим, ИнтерактивноеПереключениеРежима = Ложь)

	Если ИнтерактивноеПереключениеРежима Тогда
		ЗаполнитьТаблицуИзДерева();
	КонецЕсли; 
	
	Если Режим = "ПоСчетам" Тогда
	    Элементы.ВыборТипаГруппировки.Заголовок = "Группировка по счетам ДУ";
		Элементы.ФормаКомандаГруппировкаПоДекларациям.Пометка = Ложь;
		Элементы.ФормаКомандаГруппировкаПоСчетамДУ.Пометка = Истина;
		Элементы.СоставСовокупнойИнвестДекларацииОрганизация_ТипИД.Заголовок = "Организация / тип инвестиционной декларации";
		Элементы.СоставСовокупнойИнвестДекларацииСчетДУ_ИД.Заголовок = "Счет доверительного управления / инвестиционная декларация";
		ЭтаФорма.РежимГруппировки = "ПоСчетам";
	ИначеЕсли Режим = "ПоИД" Тогда 
		Элементы.ВыборТипаГруппировки.Заголовок = "Группировка по декларациям";
		Элементы.ФормаКомандаГруппировкаПоДекларациям.Пометка = Истина;
		Элементы.ФормаКомандаГруппировкаПоСчетамДУ.Пометка = Ложь;
		Элементы.СоставСовокупнойИнвестДекларацииОрганизация_ТипИД.Заголовок = "Тип инвестиционной декларации / организация";
		Элементы.СоставСовокупнойИнвестДекларацииСчетДУ_ИД.Заголовок = "Инвестиционная декларация / счет доверительного управления";
		ЭтаФорма.РежимГруппировки = "ПоИД";
	КонецЕсли; 

	ЗаполнитьДеревоИзТаблицы();
	ЗаполнитьСовокупныеПоказатели(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСвернутьВсе(Команда)
	
	Для Каждого Строка Из СоставСовокупнойИнвестДекларации.ПолучитьЭлементы() Цикл
		СвернутьВетку(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазвернутьВсе(Команда)
	
	Для Каждого Строка Из СоставСовокупнойИнвестДекларации.ПолучитьЭлементы() Цикл
		Элементы.СоставСовокупнойИнвестДекларации.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВетку(Ветка)
	
	Для Каждого ДочерняяВетка Из Ветка.ПолучитьЭлементы() Цикл
		СвернутьВетку(ДочерняяВетка);
	КонецЦикла;
	
	Элементы.СоставСовокупнойИнвестДекларации.Свернуть(Ветка.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСовокупнойИнвестДекларацииПриАктивизацииСтроки(Элемент)
	
	Если ЭтаФорма.РежимГруппировки = "ПоИД" Тогда 
		
		ТекДанные = ЭтаФорма.Элементы.СоставСовокупнойИнвестДекларации.ТекущиеДанные;
		
		Родитель = ТекДанные.ПолучитьРодителя();
			
		Если Родитель <> Неопределено Тогда
			ТекДанные = Родитель;
		КонецЕсли;
		
		ЭтаФорма.СовокупнаяСЧА = ТекДанные.СЧА;
		ЭтаФорма.СовокупнаяРСА = ТекДанные.РСА;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставСовокупнойИнвестДекларацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекСтрока = ЭтаФорма.СоставСовокупнойИнвестДекларации.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ТекСтрока.Организация = ЭтаФорма.ВладелецФормы.Объект.Организация Тогда
	
		ЕстьПодчиненные = (ТекСтрока.ПолучитьЭлементы().Количество() > 0);
		
		Если Поле.Имя = "СоставСовокупнойИнвестДекларацииОрганизация_ТипИД" Тогда
		
			Если ЭтаФорма.РежимГруппировки = "ПоСчетам" Тогда
				Значение = ?(ЕстьПодчиненные, ТекСтрока.Организация, ТекСтрока.Назначение);
			ИначеЕсли ЭтаФорма.РежимГруппировки = "ПоИД" Тогда 
				Значение = ?(ЕстьПодчиненные, ТекСтрока.Назначение, ТекСтрока.Организация);
			КонецЕсли; 
			
		ИначеЕсли Поле.Имя = "СоставСовокупнойИнвестДекларацииСчетДУ_ИД" Тогда 
			
			Если ЭтаФорма.РежимГруппировки = "ПоСчетам" Тогда
				Значение = ?(ЕстьПодчиненные, ТекСтрока.СчетДоверительногоУправления, ТекСтрока.ИнвестиционнаяДекларация);
			ИначеЕсли ЭтаФорма.РежимГруппировки = "ПоИД" Тогда 
				Значение = ?(ЕстьПодчиненные, ТекСтрока.ИнвестиционнаяДекларация, ТекСтрока.СчетДоверительногоУправления);
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Значение) Тогда
			СтандартнаяОбработка = Ложь;
			ОткрытьЗначение(Значение);
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры
